/*
***************************************************************************
*    模块：Test_DCMotor 
*    描述：DCMotor 应用测试
*    作者：Huo
*    时间：2017.09.07
*    版本：UP-Magic-Version 1.0.0
***************************************************************************
*/
#include "Test_DCMotor.h"
/*
***************************************************************************
*	函 数 名: Test_DCMotor
*	功能说明: DCMotor 应用函数
*	形    参: 无
*	返 回 值: 无
***************************************************************************
*/
void Test_DCMotor(void)
{
	while(1)
	{
//		BSP_DCMotor1_Go(0);		//0-1000
//		BSP_DCMotor2_Go(1000);		//0-1000
//		BSP_DCMotor3_Go(0);		//0-1000
//		BSP_DCMotor4_Go(1000);		//0-1000
//		BSP_DCMotor5_Go(0);		//0-1000
//		BSP_DCMotor6_Go(1000);		//0-1000
//		BSP_DCMotor7_Go(0);		//0-1000
//		BSP_DCMotor8_Go(1000);		//0-1000
	}
}
